{"class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"go_backwards": false, "kernel_regularizer": null, "return_state": false, "batch_input_shape": [null, 20, 6], "stateful": false, "dtype": "float32", "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "unit_forget_bias": true, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "implementation": 1, "activity_regularizer": null, "units": 200, "recurrent_constraint": null, "bias_constraint": null, "trainable": true, "name": "lstm_1", "activation": "tanh", "kernel_constraint": null, "return_sequences": false, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "units": 1, "use_bias": true, "bias_constraint": null, "trainable": true, "name": "dense_1", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}]}