{"config": [{"config": {"use_bias": true, "recurrent_constraint": null, "recurrent_regularizer": null, "dtype": "float32", "dropout": 0.0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "unroll": false, "return_sequences": false, "activity_regularizer": null, "batch_input_shape": [null, 96, 11], "units": 50, "unit_forget_bias": true, "go_backwards": false, "implementation": 1, "bias_regularizer": null, "bias_constraint": null, "recurrent_dropout": 0.0, "return_state": false, "stateful": false}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "name": "dropout_1", "rate": 0.25, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "units": 1, "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}