{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"units": 50, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "unit_forget_bias": true, "activation": "tanh", "stateful": false, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "batch_input_shape": [null, 24, 11], "go_backwards": false, "name": "lstm_1", "implementation": 1, "trainable": true, "bias_constraint": null, "dropout": 0.0, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "return_sequences": false, "return_state": false, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"units": 1, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}]}