{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"return_sequences": false, "unit_forget_bias": true, "recurrent_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "use_bias": true, "implementation": 1, "recurrent_dropout": 0.0, "batch_input_shape": [null, 10, 11], "recurrent_constraint": null, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "name": "lstm_1", "activation": "tanh", "return_state": false, "go_backwards": false, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "units": 500, "bias_regularizer": null, "kernel_constraint": null, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "noise_shape": null, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}]}