{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "recurrent_activation": "hard_sigmoid", "use_bias": true, "go_backwards": false, "stateful": false, "units": 50, "dropout": 0.0, "return_sequences": false, "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "return_state": false, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "name": "lstm_1", "unit_forget_bias": true, "batch_input_shape": [null, 24, 11], "implementation": 1, "activity_regularizer": null, "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_1", "bias_constraint": null, "units": 1, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}], "keras_version": "2.2.2", "backend": "tensorflow"}