{"class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"unroll": false, "bias_constraint": null, "trainable": true, "use_bias": true, "recurrent_regularizer": null, "implementation": 1, "name": "lstm_3", "kernel_regularizer": null, "kernel_constraint": null, "stateful": false, "unit_forget_bias": true, "units": 50, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "batch_input_shape": [null, 24, 11], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dtype": "float32", "go_backwards": false, "return_sequences": false, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "return_state": false, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_3", "noise_shape": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_3", "kernel_regularizer": null, "kernel_constraint": null, "units": 1, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_3"}}]}