{"config": [{"config": {"batch_input_shape": [null, 24, 11], "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dropout": 0.0, "units": 50, "trainable": true, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "activation": "tanh", "implementation": 1, "recurrent_regularizer": null, "name": "lstm_1", "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": false, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "unroll": false, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 1, "trainable": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow"}