{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "kernel_constraint": null, "unroll": false, "return_state": false, "dtype": "float32", "implementation": 1, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 24, 11], "units": 50, "go_backwards": false, "use_bias": true, "activation": "tanh", "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "name": "lstm_1", "dropout": 0.0, "unit_forget_bias": true, "stateful": false, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "return_sequences": false, "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.25, "trainable": true, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "use_bias": true, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}]}