{"keras_version": "2.2.2", "config": [{"config": {"dtype": "float32", "go_backwards": false, "return_state": false, "activation": "tanh", "name": "lstm_1", "recurrent_constraint": null, "return_sequences": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "unroll": false, "kernel_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "implementation": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "trainable": true, "recurrent_regularizer": null, "units": 500, "bias_regularizer": null, "batch_input_shape": [null, 24, 11], "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"seed": null, "rate": 0.25, "trainable": true, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "units": 1, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_1"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}