{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"go_backwards": false, "return_sequences": false, "recurrent_constraint": null, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_dropout": 0.0, "implementation": 1, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "stateful": false, "batch_input_shape": [null, 24, 3], "recurrent_regularizer": null, "bias_regularizer": null, "dropout": 0.0, "bias_constraint": null, "use_bias": true, "units": 200, "name": "lstm_1"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.25, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "units": 1, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}], "backend": "tensorflow", "keras_version": "2.2.2"}