{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "stateful": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "batch_input_shape": [null, 10, 3], "dropout": 0.0, "unroll": false, "bias_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "units": 200, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "return_state": false, "bias_constraint": null, "implementation": 1, "dtype": "float32", "return_sequences": false, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "trainable": true, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "noise_shape": null, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "units": 1, "kernel_constraint": null, "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}], "keras_version": "2.2.2"}