{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "kernel_constraint": null, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "batch_input_shape": [null, 60, 5], "go_backwards": false, "recurrent_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "unroll": false, "dtype": "float32", "bias_constraint": null, "unit_forget_bias": true, "dropout": 0.0, "return_sequences": false, "activation": "tanh", "trainable": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "implementation": 1, "recurrent_dropout": 0.0, "units": 100, "return_state": false}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_1", "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "units": 1, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}]}