{"backend": "tensorflow", "keras_version": "2.2.2", "config": [{"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "tanh", "dtype": "float32", "activity_regularizer": null, "trainable": true, "units": 100, "stateful": false, "unit_forget_bias": true, "return_state": false, "batch_input_shape": [null, 60, 5], "recurrent_constraint": null, "recurrent_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_1", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "return_sequences": false, "implementation": 1, "go_backwards": false, "bias_constraint": null, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"seed": null, "rate": 0.25, "name": "dropout_1", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}