{"backend": "tensorflow", "keras_version": "2.2.2", "config": [{"config": {"recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "return_state": false, "units": 200, "unit_forget_bias": true, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dtype": "float32", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "stateful": false, "activation": "tanh", "implementation": 1, "unroll": false, "go_backwards": false, "kernel_constraint": null, "dropout": 0.0, "trainable": true, "recurrent_dropout": 0.0, "bias_constraint": null, "return_sequences": false, "recurrent_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 10, 3], "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "name": "dense_1", "activation": "linear", "units": 1, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential"}