{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"trainable": true, "bias_regularizer": null, "kernel_constraint": null, "unroll": false, "implementation": 1, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 200, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "activation": "tanh", "go_backwards": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "lstm_1", "unit_forget_bias": true, "return_state": false, "use_bias": true, "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dtype": "float32", "batch_input_shape": [null, 24, 3]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 1, "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}], "keras_version": "2.2.2", "backend": "tensorflow"}