{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"units": 200, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "activity_regularizer": null, "recurrent_constraint": null, "dtype": "float32", "use_bias": true, "batch_input_shape": [null, 10, 3], "bias_constraint": null, "dropout": 0.0, "trainable": true, "bias_regularizer": null, "implementation": 1, "unit_forget_bias": true, "return_sequences": false, "unroll": false, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "recurrent_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"activation": "linear", "units": 1, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}]}