{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"return_sequences": false, "return_state": false, "dropout": 0.0, "bias_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "stateful": false, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "recurrent_constraint": null, "kernel_constraint": null, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "implementation": 1, "units": 100, "trainable": true, "unroll": false, "go_backwards": false, "activation": "tanh", "recurrent_dropout": 0.0, "batch_input_shape": [null, 60, 5], "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "linear", "name": "dense_1", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 1, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}]}