{"backend": "tensorflow", "config": [{"config": {"return_sequences": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 200, "activity_regularizer": null, "recurrent_dropout": 0.0, "activation": "tanh", "implementation": 1, "dropout": 0.0, "recurrent_regularizer": null, "dtype": "float32", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "name": "lstm_1", "use_bias": true, "kernel_regularizer": null, "trainable": true, "stateful": false, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false, "unit_forget_bias": true, "bias_regularizer": null, "go_backwards": false, "unroll": false, "batch_input_shape": [null, 24, 3]}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "use_bias": true, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.2"}