{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "recurrent_regularizer": null, "stateful": false, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "return_state": false, "unroll": false, "recurrent_activation": "hard_sigmoid", "units": 50, "bias_constraint": null, "unit_forget_bias": true, "dropout": 0.0, "activation": "tanh", "implementation": 1, "go_backwards": false, "batch_input_shape": [null, 20, 11], "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "dtype": "float32", "bias_regularizer": null, "return_sequences": false}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "kernel_regularizer": null, "trainable": true, "units": 1, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}], "backend": "tensorflow"}