{"config": [{"config": {"implementation": 1, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "dropout": 0.0, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "batch_input_shape": [null, 24, 11], "recurrent_regularizer": null, "recurrent_constraint": null, "return_sequences": false, "dtype": "float32", "units": 200, "trainable": true, "unit_forget_bias": true, "activation": "tanh", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}