{"config": [{"class_name": "LSTM", "config": {"stateful": false, "activation": "tanh", "bias_constraint": null, "unit_forget_bias": true, "unroll": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "units": 200, "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "go_backwards": false, "return_sequences": false, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "dtype": "float32", "return_state": false, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_1", "batch_input_shape": [null, 24, 11], "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_1", "units": 1, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}