{"keras_version": "2.2.2", "backend": "tensorflow", "config": [{"config": {"unit_forget_bias": true, "activation": "tanh", "recurrent_constraint": null, "dropout": 0.0, "go_backwards": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 10, 3], "use_bias": true, "return_state": false, "implementation": 1, "bias_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": false, "units": 200, "bias_regularizer": null, "kernel_constraint": null, "unroll": false, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "trainable": true, "activation": "linear", "bias_constraint": null, "units": 1, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential"}