{"config": [{"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "return_state": false, "bias_regularizer": null, "dropout": 0.0, "dtype": "float32", "name": "lstm_1", "units": 200, "unroll": false, "recurrent_regularizer": null, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "implementation": 1, "go_backwards": false, "bias_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "stateful": false, "unit_forget_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 10, 3], "activation": "tanh", "kernel_constraint": null, "use_bias": true, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "units": 1, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2"}