{"backend": "tensorflow", "config": [{"config": {"unroll": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "lstm_1", "dtype": "float32", "go_backwards": false, "return_sequences": false, "bias_constraint": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "activation": "tanh", "units": 200, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "implementation": 1, "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "use_bias": true, "recurrent_constraint": null, "batch_input_shape": [null, 10, 3], "stateful": false, "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.2.2", "class_name": "Sequential"}