{"keras_version": "2.2.2", "backend": "tensorflow", "config": [{"config": {"use_bias": true, "bias_constraint": null, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "batch_input_shape": [null, 10, 3], "recurrent_regularizer": null, "units": 200, "return_sequences": false, "trainable": true, "dropout": 0.0, "name": "lstm_1", "unroll": false, "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_constraint": null, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "stateful": false}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "units": 1, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential"}