{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"return_sequences": false, "units": 200, "activity_regularizer": null, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "return_state": false, "dropout": 0.0, "kernel_constraint": null, "stateful": false, "use_bias": true, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "unroll": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "batch_input_shape": [null, 10, 3], "recurrent_constraint": null, "recurrent_dropout": 0.0, "activation": "tanh", "implementation": 1, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "rate": 0.25, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_constraint": null, "units": 1, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}], "keras_version": "2.2.2"}