{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 200, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "activity_regularizer": null, "batch_input_shape": [null, 10, 3], "name": "lstm_1", "use_bias": true, "implementation": 1, "bias_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "stateful": false, "unroll": false, "recurrent_constraint": null, "go_backwards": false, "unit_forget_bias": true, "return_state": false, "activation": "tanh", "recurrent_dropout": 0.0, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 1, "name": "dense_1", "trainable": true, "activity_regularizer": null, "activation": "linear", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}]}