{"keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"dtype": "float32", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "dropout": 0.0, "return_sequences": false, "activation": "tanh", "kernel_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "implementation": 1, "use_bias": true, "trainable": true, "units": 200, "go_backwards": false, "bias_constraint": null, "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "recurrent_constraint": null, "batch_input_shape": [null, 10, 3], "stateful": false, "recurrent_dropout": 0.0, "return_state": false, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "units": 1}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}]}