{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "use_bias": true, "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "go_backwards": false, "activation": "tanh", "kernel_constraint": null, "units": 200, "implementation": 1, "recurrent_dropout": 0.0, "trainable": true, "return_state": false, "recurrent_regularizer": null, "stateful": false, "bias_constraint": null, "unit_forget_bias": true, "batch_input_shape": [null, 10, 3], "bias_regularizer": null, "dtype": "float32", "dropout": 0.0, "unroll": false, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "return_sequences": false}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "noise_shape": null, "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "trainable": true, "units": 1, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}], "keras_version": "2.2.2"}