{"config": [{"config": {"trainable": true, "implementation": 1, "unroll": false, "dtype": "float32", "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "bias_regularizer": null, "name": "lstm_1", "unit_forget_bias": true, "recurrent_dropout": 0.0, "batch_input_shape": [null, 10, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "recurrent_constraint": null, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_regularizer": null, "use_bias": true, "stateful": false, "kernel_regularizer": null, "units": 200, "bias_constraint": null, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "units": 1, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}