{"backend": "tensorflow", "config": [{"config": {"recurrent_dropout": 0.0, "units": 500, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "stateful": false, "dropout": 0.0, "unroll": false, "go_backwards": false, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 1, "use_bias": true, "recurrent_regularizer": null, "batch_input_shape": [null, 20, 4], "bias_constraint": null, "recurrent_constraint": null, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "name": "lstm_1", "activation": "tanh", "dtype": "float32", "return_sequences": false, "return_state": false, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_1", "activation": "linear", "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}, "class_name": "Activation"}], "keras_version": "2.2.2", "class_name": "Sequential"}