{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 20, 4], "return_state": false, "activation": "tanh", "trainable": true, "bias_regularizer": null, "stateful": false, "bias_constraint": null, "go_backwards": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "recurrent_dropout": 0.0, "unroll": false, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "unit_forget_bias": true, "name": "lstm_1", "recurrent_regularizer": null, "kernel_regularizer": null, "implementation": 1, "dropout": 0.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activation": "linear", "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_1", "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_1", "trainable": true}}]}