{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "return_sequences": false, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "unroll": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "tanh", "batch_input_shape": [null, 20, 4], "use_bias": true, "units": 200, "implementation": 1, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "trainable": true, "name": "lstm_1", "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dtype": "float32", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"units": 1, "trainable": true, "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}}], "backend": "tensorflow", "keras_version": "2.2.2"}