{"keras_version": "2.2.2", "backend": "tensorflow", "config": [{"config": {"return_sequences": false, "stateful": false, "kernel_constraint": null, "activation": "tanh", "dropout": 0.0, "dtype": "float32", "name": "lstm_1", "trainable": true, "return_state": false, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "go_backwards": false, "implementation": 1, "batch_input_shape": [null, 20, 4], "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "units": 500, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "trainable": true, "units": 1, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential"}