{"backend": "tensorflow", "config": [{"config": {"kernel_regularizer": null, "dtype": "float32", "return_state": false, "activity_regularizer": null, "dropout": 0.0, "batch_input_shape": [null, 20, 4], "recurrent_regularizer": null, "unroll": false, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "go_backwards": false, "bias_constraint": null, "bias_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 200, "trainable": true, "recurrent_dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "return_sequences": false, "unit_forget_bias": true, "stateful": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 1, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "keras_version": "2.2.2", "class_name": "Sequential"}