{"config": [{"config": {"recurrent_dropout": 0.0, "kernel_regularizer": null, "unroll": false, "activation": "tanh", "stateful": false, "return_sequences": false, "unit_forget_bias": true, "use_bias": true, "trainable": true, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "batch_input_shape": [null, 20, 4], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 500, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "name": "lstm_1", "kernel_constraint": null, "recurrent_regularizer": null, "bias_constraint": null, "dropout": 0.0, "implementation": 1}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}, "class_name": "Activation"}], "keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow"}