{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dropout": 0.0, "recurrent_dropout": 0.0, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "tanh", "units": 200, "unit_forget_bias": true, "go_backwards": false, "kernel_regularizer": null, "implementation": 1, "return_sequences": false, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "recurrent_constraint": null, "name": "lstm_1", "bias_regularizer": null, "batch_input_shape": [null, 20, 4], "return_state": false, "use_bias": true, "recurrent_regularizer": null, "kernel_constraint": null, "stateful": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "name": "dense_1", "bias_regularizer": null, "trainable": true, "activation": "linear", "use_bias": true, "units": 1, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}]}