{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"trainable": true, "return_state": false, "kernel_regularizer": null, "unit_forget_bias": true, "name": "lstm_1", "go_backwards": false, "bias_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "recurrent_dropout": 0.0, "units": 500, "dropout": 0.0, "batch_input_shape": [null, 20, 4], "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "dtype": "float32", "return_sequences": false, "stateful": false, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "use_bias": true}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}}]}