{"backend": "tensorflow", "config": [{"config": {"return_state": false, "unroll": false, "stateful": false, "trainable": true, "recurrent_regularizer": null, "units": 500, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "use_bias": true, "kernel_regularizer": null, "batch_input_shape": [null, 20, 4], "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activation": "tanh", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "name": "lstm_1", "go_backwards": false, "recurrent_constraint": null, "implementation": 1, "dtype": "float32", "return_sequences": false}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.2"}