{"backend": "tensorflow", "keras_version": "2.2.2", "config": [{"config": {"kernel_regularizer": null, "use_bias": true, "go_backwards": false, "batch_input_shape": [null, 20, 4], "recurrent_activation": "hard_sigmoid", "implementation": 1, "bias_regularizer": null, "name": "lstm_1", "trainable": true, "return_state": false, "unit_forget_bias": true, "dropout": 0.0, "units": 500, "unroll": false, "bias_constraint": null, "return_sequences": false, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dtype": "float32", "stateful": false, "activation": "tanh", "recurrent_dropout": 0.0, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "linear", "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential"}