{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "recurrent_activation": "hard_sigmoid", "stateful": false, "batch_input_shape": [null, 20, 4], "kernel_regularizer": null, "activation": "tanh", "recurrent_dropout": 0.0, "unroll": false, "recurrent_constraint": null, "use_bias": true, "dropout": 0.0, "implementation": 1, "name": "lstm_1", "return_sequences": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "unit_forget_bias": true, "dtype": "float32", "units": 200, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "go_backwards": false}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "units": 1, "bias_constraint": null, "use_bias": true, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}]}