{"config": [{"config": {"recurrent_regularizer": null, "unit_forget_bias": true, "units": 200, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_constraint": null, "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "lstm_1", "return_state": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "batch_input_shape": [null, 20, 4], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "implementation": 1, "activation": "tanh", "go_backwards": false, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}