{"keras_version": "2.2.2", "config": [{"config": {"dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "bias_regularizer": null, "unroll": false, "dropout": 0.0, "trainable": true, "stateful": false, "units": 500, "activity_regularizer": null, "implementation": 1, "unit_forget_bias": true, "use_bias": true, "name": "lstm_1", "bias_constraint": null, "activation": "tanh", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "kernel_constraint": null, "return_state": false, "go_backwards": false, "batch_input_shape": [null, 20, 4], "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "return_sequences": false}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 1, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}