{"class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "unit_forget_bias": true, "kernel_constraint": null, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "recurrent_dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "stateful": false, "implementation": 1, "return_sequences": false, "batch_input_shape": [null, 20, 4], "name": "lstm_1", "recurrent_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "return_state": false, "dropout": 0.0, "recurrent_constraint": null, "go_backwards": false, "use_bias": true, "units": 500, "unroll": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "units": 1, "name": "dense_1", "kernel_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}}]}