{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "go_backwards": false, "bias_constraint": null, "recurrent_dropout": 0.0, "return_sequences": false, "dtype": "float32", "use_bias": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "return_state": false, "kernel_regularizer": null, "unroll": false, "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "unit_forget_bias": true, "units": 200, "batch_input_shape": [null, 20, 4], "activity_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "bias_regularizer": null, "stateful": false, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "kernel_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}}]}