{"config": [{"config": {"recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "batch_input_shape": [null, 20, 4], "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "units": 200, "unroll": false, "dropout": 0.0, "kernel_regularizer": null, "return_state": false, "bias_regularizer": null, "name": "lstm_1", "bias_constraint": null, "activation": "tanh", "return_sequences": false, "recurrent_regularizer": null, "dtype": "float32", "activity_regularizer": null, "use_bias": true, "trainable": true, "go_backwards": false, "implementation": 1, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 1, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2"}