{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"stateful": false, "name": "lstm_1", "units": 200, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "batch_input_shape": [null, 20, 4], "recurrent_dropout": 0.0, "return_state": false, "unit_forget_bias": true, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32", "recurrent_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "bias_constraint": null, "unroll": false, "activation": "tanh", "return_sequences": false, "bias_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"name": "dense_1", "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_1"}}], "keras_version": "2.2.2"}