{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "recurrent_dropout": 0.0, "units": 500, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "lstm_1", "return_state": false, "batch_input_shape": [null, 20, 4], "use_bias": true, "activation": "tanh", "implementation": 1, "recurrent_regularizer": null, "kernel_regularizer": null, "stateful": false, "trainable": true, "unit_forget_bias": true, "go_backwards": false}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "linear", "activity_regularizer": null, "units": 1, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_1", "trainable": true}}], "keras_version": "2.2.2"}