{"backend": "tensorflow", "config": [{"config": {"unroll": false, "batch_input_shape": [null, 10, 3], "recurrent_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "implementation": 1, "go_backwards": false, "trainable": true, "stateful": false, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dtype": "float32", "name": "lstm_1", "bias_regularizer": null, "activity_regularizer": null, "return_sequences": false, "unit_forget_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_regularizer": null, "recurrent_regularizer": null, "return_state": false, "units": 200, "dropout": 0.0, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.25, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "units": 1, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.2.2", "class_name": "Sequential"}