{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"dtype": "float32", "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "kernel_regularizer": null, "go_backwards": false, "dropout": 0.0, "recurrent_regularizer": null, "return_sequences": false, "activation": "tanh", "units": 200, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "unroll": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 1, "name": "lstm_1", "trainable": true, "bias_regularizer": null, "return_state": false, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 10, 3], "bias_constraint": null, "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}]}