{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "recurrent_regularizer": null, "implementation": 1, "dtype": "float32", "batch_input_shape": [null, 10, 3], "kernel_constraint": null, "stateful": false, "kernel_regularizer": null, "units": 200, "recurrent_dropout": 0.0, "bias_constraint": null, "name": "lstm_1", "recurrent_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "unroll": false, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "return_state": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.25, "trainable": true, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "units": 1, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}]}