{"config": [{"config": {"bias_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "stateful": false, "batch_input_shape": [null, 10, 3], "implementation": 1, "name": "lstm_1", "trainable": true, "use_bias": true, "units": 200, "dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "unroll": false, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "return_sequences": false, "dtype": "float32", "activation": "tanh", "return_state": false}, "class_name": "LSTM"}, {"config": {"seed": null, "trainable": true, "noise_shape": null, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "name": "dense_1", "trainable": true, "use_bias": true, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow"}