{"keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "activation": "tanh", "unit_forget_bias": true, "use_bias": true, "return_state": false, "units": 200, "dropout": 0.0, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "recurrent_dropout": 0.0, "dtype": "float32", "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "batch_input_shape": [null, 10, 3], "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "kernel_regularizer": null, "implementation": 1, "bias_regularizer": null, "kernel_constraint": null, "return_sequences": false, "name": "lstm_1", "unroll": false}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "use_bias": true, "units": 1, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}]}