{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dropout": 0.0, "bias_regularizer": null, "activity_regularizer": null, "stateful": false, "kernel_constraint": null, "go_backwards": false, "units": 200, "recurrent_regularizer": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "dtype": "float32", "bias_constraint": null, "return_sequences": false, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "batch_input_shape": [null, 10, 3], "return_state": false, "implementation": 1}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "trainable": true, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 1, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}], "backend": "tensorflow"}