{"class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"dtype": "float32", "use_bias": true, "unroll": false, "stateful": false, "units": 200, "bias_constraint": null, "implementation": 1, "return_sequences": false, "trainable": true, "recurrent_constraint": null, "go_backwards": false, "bias_regularizer": null, "return_state": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "activity_regularizer": null, "dropout": 0.0, "recurrent_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "batch_input_shape": [null, 10, 3], "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "noise_shape": null, "rate": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 1, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}]}