{"config": [{"config": {"stateful": false, "dtype": "float32", "recurrent_constraint": null, "recurrent_regularizer": null, "batch_input_shape": [null, 10, 3], "return_state": false, "return_sequences": false, "name": "lstm_1", "bias_constraint": null, "activity_regularizer": null, "dropout": 0.0, "bias_regularizer": null, "trainable": true, "units": 200, "go_backwards": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "use_bias": true, "recurrent_dropout": 0.0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "implementation": 1, "kernel_constraint": null, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "rate": 0.25, "trainable": true, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "units": 1, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}