{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "kernel_constraint": null, "implementation": 1, "use_bias": true, "batch_input_shape": [null, 10, 3], "recurrent_constraint": null, "return_sequences": false, "recurrent_dropout": 0.0, "activation": "tanh", "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "activity_regularizer": null, "unroll": false, "units": 200, "bias_regularizer": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "trainable": true, "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "dtype": "float32", "stateful": false, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_1", "rate": 0.25, "noise_shape": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 1, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}], "keras_version": "2.2.2", "backend": "tensorflow"}