{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"unroll": false, "bias_constraint": null, "stateful": false, "activation": "tanh", "use_bias": true, "trainable": true, "units": 200, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 10, 3], "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "unit_forget_bias": true, "activity_regularizer": null, "go_backwards": false, "return_sequences": false, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "dropout": 0.0, "recurrent_regularizer": null, "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.25, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "units": 1, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}]}