{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "recurrent_constraint": null, "return_state": false, "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "unroll": false, "dtype": "float32", "units": 200, "return_sequences": false, "implementation": 1, "batch_input_shape": [null, 10, 3], "activation": "tanh", "go_backwards": false, "unit_forget_bias": true, "name": "lstm_1", "kernel_constraint": null, "trainable": true, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.25, "name": "dropout_1", "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "activation": "linear", "units": 1, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}]}