{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_constraint": null, "name": "lstm_1", "return_sequences": false, "kernel_regularizer": null, "return_state": false, "stateful": false, "unit_forget_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "units": 200, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "batch_input_shape": [null, 10, 3], "use_bias": true, "unroll": false, "trainable": true, "dtype": "float32", "go_backwards": false}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_regularizer": null, "units": 1, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}], "keras_version": "2.2.2"}