{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "batch_input_shape": [null, 10, 3], "return_sequences": false, "use_bias": true, "go_backwards": false, "stateful": false, "bias_constraint": null, "dtype": "float32", "recurrent_regularizer": null, "name": "lstm_1", "trainable": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "implementation": 1, "activation": "tanh", "kernel_constraint": null, "activity_regularizer": null, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 200, "dropout": 0.0, "kernel_regularizer": null, "unroll": false, "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "units": 1, "name": "dense_1", "trainable": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}], "keras_version": "2.2.2", "backend": "tensorflow"}