{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "unroll": false, "kernel_constraint": null, "return_sequences": false, "kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "units": 200, "unit_forget_bias": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "tanh", "activity_regularizer": null, "return_state": false, "stateful": false, "trainable": true, "use_bias": true, "bias_regularizer": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "batch_input_shape": [null, 10, 3], "implementation": 1, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "name": "lstm_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}]}