{"backend": "tensorflow", "config": [{"config": {"use_bias": true, "recurrent_dropout": 0.0, "trainable": true, "batch_input_shape": [null, 10, 3], "implementation": 1, "dropout": 0.0, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_constraint": null, "units": 200, "go_backwards": false, "bias_constraint": null, "stateful": false, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "kernel_constraint": null, "unroll": false, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "bias_regularizer": null, "activity_regularizer": null, "return_sequences": false, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "dense_1", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 1, "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "keras_version": "2.2.2", "class_name": "Sequential"}