{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false, "bias_regularizer": null, "name": "lstm_1", "use_bias": true, "units": 200, "go_backwards": false, "implementation": 1, "recurrent_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "activation": "tanh", "dropout": 0.0, "batch_input_shape": [null, 24, 3], "trainable": true, "bias_constraint": null, "stateful": false, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.25, "name": "dropout_1", "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "trainable": true, "bias_constraint": null, "use_bias": true, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}], "backend": "tensorflow", "keras_version": "2.2.2"}