{"keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_regularizer": null, "batch_input_shape": [null, 10, 3], "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "activation": "tanh", "dropout": 0.0, "unroll": false, "return_state": false, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 200, "recurrent_constraint": null, "use_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_regularizer": null, "unit_forget_bias": true, "implementation": 1, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "return_sequences": false}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.25, "trainable": true, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 1, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "trainable": true, "name": "dense_1", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}]}