{"config": [{"config": {"dtype": "float32", "implementation": 1, "trainable": true, "return_sequences": false, "use_bias": true, "return_state": false, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "activation": "tanh", "bias_regularizer": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "stateful": false, "bias_constraint": null, "kernel_constraint": null, "go_backwards": false, "kernel_regularizer": null, "units": 200, "recurrent_constraint": null, "unit_forget_bias": true, "dropout": 0.0, "batch_input_shape": [null, 10, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "lstm_1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "units": 1, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_1"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}