{"keras_version": "2.2.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"activation": "tanh", "batch_input_shape": [null, 10, 3], "return_sequences": false, "unroll": false, "units": 200, "unit_forget_bias": true, "recurrent_regularizer": null, "use_bias": true, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 1, "go_backwards": false, "name": "lstm_1", "bias_constraint": null, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "dtype": "float32", "dropout": 0.0, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "units": 1, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}], "class_name": "Sequential"}