{"keras_version": "2.2.2", "backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "tanh", "unroll": false, "recurrent_regularizer": null, "implementation": 1, "go_backwards": false, "bias_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 10, 3], "unit_forget_bias": true, "trainable": true, "kernel_constraint": null, "use_bias": true, "name": "lstm_1", "return_sequences": false, "return_state": false, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "activity_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "stateful": false, "bias_constraint": null, "dropout": 0.0, "units": 200}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "trainable": true, "rate": 0.25, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 1, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential"}