{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"trainable": true, "unit_forget_bias": true, "stateful": false, "dtype": "float32", "recurrent_constraint": null, "unroll": false, "return_sequences": false, "go_backwards": false, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "units": 200, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "return_state": false, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "kernel_regularizer": null, "dropout": 0.0, "activation": "tanh", "batch_input_shape": [null, 10, 3], "recurrent_dropout": 0.0, "activity_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.25, "trainable": true, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}], "keras_version": "2.2.2"}