{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "activation": "tanh", "dtype": "float32", "batch_input_shape": [null, 10, 3], "recurrent_dropout": 0.0, "kernel_regularizer": null, "units": 200, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "unroll": false, "go_backwards": false, "activity_regularizer": null, "trainable": true, "implementation": 1, "name": "lstm_1", "unit_forget_bias": true, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "recurrent_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "return_state": false, "kernel_constraint": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "units": 1, "name": "dense_1", "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}]}