{"config": [{"config": {"units": 200, "recurrent_activation": "hard_sigmoid", "unroll": false, "activity_regularizer": null, "return_sequences": false, "bias_regularizer": null, "use_bias": true, "trainable": true, "name": "lstm_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_constraint": null, "stateful": false, "go_backwards": false, "bias_constraint": null, "batch_input_shape": [null, 10, 3], "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "implementation": 1, "kernel_constraint": null, "recurrent_dropout": 0.0, "activation": "tanh", "dtype": "float32"}, "class_name": "LSTM"}, {"config": {"trainable": true, "seed": null, "name": "dropout_1", "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}