{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "return_state": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 10, 3], "unroll": false, "go_backwards": false, "name": "lstm_1", "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 1, "use_bias": true, "return_sequences": false, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dtype": "float32", "activation": "tanh", "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "stateful": false, "kernel_constraint": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.25, "name": "dropout_1", "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "units": 1}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}]}