{"backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"trainable": true, "unroll": false, "use_bias": true, "recurrent_dropout": 0.0, "go_backwards": false, "activation": "tanh", "stateful": false, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "dropout": 0.0, "units": 200, "activity_regularizer": null, "recurrent_regularizer": null, "implementation": 1, "batch_input_shape": [null, 10, 3], "return_state": false, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "unit_forget_bias": true, "dtype": "float32", "recurrent_constraint": null, "return_sequences": false}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "units": 1, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}], "class_name": "Sequential", "keras_version": "2.2.2"}