{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"return_sequences": false, "go_backwards": false, "units": 200, "dtype": "float32", "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "use_bias": true, "recurrent_dropout": 0.0, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "implementation": 1, "activity_regularizer": null, "stateful": false, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "name": "lstm_1", "activation": "tanh", "trainable": true, "unroll": false, "batch_input_shape": [null, 10, 3]}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "trainable": true, "bias_regularizer": null, "units": 1, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}], "keras_version": "2.2.2"}