{"config": [{"config": {"kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "lstm_1", "unroll": false, "batch_input_shape": [null, 20, 5], "bias_constraint": null, "bias_regularizer": null, "return_state": false, "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "unit_forget_bias": true, "units": 100, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "go_backwards": false, "stateful": false, "implementation": 1, "trainable": true, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activation": "tanh", "return_sequences": false, "recurrent_regularizer": null, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"units": 1, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}