{"config": [{"config": {"stateful": false, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "activity_regularizer": null, "go_backwards": false, "dtype": "float32", "return_state": false, "recurrent_regularizer": null, "name": "lstm_1", "units": 100, "activation": "tanh", "return_sequences": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "bias_regularizer": null, "batch_input_shape": [null, 20, 5], "implementation": 1, "dropout": 0.0, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"activation": "linear", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "units": 1, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}