{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"go_backwards": false, "recurrent_regularizer": null, "batch_input_shape": [null, 20, 5], "recurrent_constraint": null, "dropout": 0.0, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "unit_forget_bias": true, "units": 100, "return_sequences": false, "unroll": false, "implementation": 1, "recurrent_dropout": 0.0, "kernel_constraint": null, "trainable": true, "activation": "tanh", "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "lstm_1", "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1", "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}], "keras_version": "2.2.2"}