{"config": [{"config": {"name": "lstm_1", "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "kernel_constraint": null, "return_state": false, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 20, 6], "unit_forget_bias": true, "units": 200, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "return_sequences": false, "stateful": false, "activation": "tanh", "recurrent_regularizer": null, "use_bias": true, "kernel_regularizer": null, "dropout": 0.0, "trainable": true, "unroll": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 1, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "trainable": true, "seed": null, "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2"}