{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"go_backwards": false, "return_state": false, "bias_constraint": null, "units": 200, "return_sequences": false, "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activity_regularizer": null, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "use_bias": true, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activation": "tanh", "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "unit_forget_bias": true, "name": "lstm_1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 24, 6], "stateful": false, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 1, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}]}