{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"unit_forget_bias": true, "kernel_regularizer": null, "dropout": 0.0, "stateful": false, "bias_regularizer": null, "recurrent_constraint": null, "batch_input_shape": [null, 200, 6], "name": "lstm_1", "use_bias": true, "activation": "tanh", "units": 200, "bias_constraint": null, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32", "implementation": 1, "return_sequences": false, "recurrent_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "use_bias": true, "activation": "linear", "name": "dense_1", "units": 1, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}]}