{"config": [{"config": {"activity_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "implementation": 1, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "return_sequences": false, "bias_regularizer": null, "kernel_constraint": null, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 24, 3], "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "name": "lstm_1", "stateful": false, "recurrent_regularizer": null, "use_bias": true, "trainable": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "units": 200}, "class_name": "LSTM"}, {"config": {"seed": null, "noise_shape": null, "rate": 0.25, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "units": 1, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"activation": "linear", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow"}