{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"units": 200, "return_state": false, "use_bias": true, "unroll": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "dtype": "float32", "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "batch_input_shape": [null, 24, 3], "activity_regularizer": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "kernel_regularizer": null, "return_sequences": false, "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "implementation": 1, "recurrent_dropout": 0.0, "activation": "tanh", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"units": 1, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}]}