{"backend": "tensorflow", "config": [{"config": {"return_state": false, "recurrent_constraint": null, "unit_forget_bias": true, "units": 200, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "batch_input_shape": [null, 10, 3], "name": "lstm_1", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "go_backwards": false, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_regularizer": null, "implementation": 1, "dtype": "float32", "dropout": 0.0, "unroll": false, "return_sequences": false, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "units": 1, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.2"}