{"class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "stateful": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "bias_regularizer": null, "go_backwards": false, "batch_input_shape": [null, 10, 3], "recurrent_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 1, "dtype": "float32", "unit_forget_bias": true, "bias_constraint": null, "dropout": 0.0, "trainable": true, "return_state": false, "return_sequences": false, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.25, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "bias_constraint": null, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}]}