{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "go_backwards": false, "return_state": false, "bias_constraint": null, "dropout": 0.0, "dtype": "float32", "activity_regularizer": null, "units": 200, "kernel_regularizer": null, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "return_sequences": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_regularizer": null, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "batch_input_shape": [null, 10, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "tanh", "trainable": true, "stateful": false, "recurrent_dropout": 0.0}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "trainable": true, "name": "dense_1", "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}], "backend": "tensorflow", "keras_version": "2.2.2"}