{"config": [{"config": {"dropout": 0.0, "bias_constraint": null, "return_sequences": false, "unroll": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "implementation": 1, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "name": "lstm_1", "dtype": "float32", "activity_regularizer": null, "units": 200, "kernel_regularizer": null, "recurrent_constraint": null, "return_state": false, "go_backwards": false, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "kernel_constraint": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 10, 3]}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "units": 1, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}