{"class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "trainable": true, "implementation": 1, "bias_constraint": null, "batch_input_shape": [null, 10, 3], "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "recurrent_dropout": 0.0, "name": "lstm_1", "return_state": false, "kernel_regularizer": null, "return_sequences": false, "activity_regularizer": null, "activation": "tanh", "dropout": 0.0, "recurrent_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dtype": "float32", "units": 200, "bias_regularizer": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}]}