{"keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"activation": "tanh", "dropout": 0.0, "return_sequences": false, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "unit_forget_bias": true, "recurrent_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_1", "kernel_regularizer": null, "units": 200, "unroll": false, "go_backwards": false, "batch_input_shape": [null, 24, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "stateful": false, "dtype": "float32", "kernel_constraint": null, "return_state": false, "trainable": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "units": 1, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}], "backend": "tensorflow"}