{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"activation": "tanh", "unroll": false, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 1, "bias_constraint": null, "dropout": 0.0, "bias_regularizer": null, "return_state": false, "recurrent_constraint": null, "stateful": false, "dtype": "float32", "name": "lstm_1", "batch_input_shape": [null, 24, 3], "units": 200, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "use_bias": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "rate": 0.25, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "linear", "units": 1, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}]}