{"keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "bias_constraint": null, "name": "lstm_1", "activation": "tanh", "kernel_constraint": null, "use_bias": true, "stateful": false, "return_state": false, "activity_regularizer": null, "implementation": 1, "unit_forget_bias": true, "units": 200, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "unroll": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "batch_input_shape": [null, 24, 3], "dtype": "float32", "return_sequences": false, "dropout": 0.0, "trainable": true, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "rate": 0.25, "noise_shape": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "units": 1, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_1", "activation": "linear", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}], "backend": "tensorflow"}