{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "unit_forget_bias": true, "activation": "tanh", "kernel_regularizer": null, "implementation": 1, "recurrent_activation": "hard_sigmoid", "units": 200, "use_bias": true, "trainable": true, "go_backwards": false, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "dropout": 0.0, "dtype": "float32", "return_sequences": false, "recurrent_constraint": null, "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 10, 3], "unroll": false, "stateful": false, "name": "lstm_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 1, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "use_bias": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}]}