{"keras_version": "2.2.2", "backend": "tensorflow", "config": [{"config": {"batch_input_shape": [null, 10, 3], "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "stateful": false, "return_sequences": false, "implementation": 1, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 200, "trainable": true, "bias_regularizer": null, "go_backwards": false, "dtype": "float32", "kernel_regularizer": null, "name": "lstm_1", "return_state": false, "recurrent_regularizer": null, "unroll": false, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "use_bias": true, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"rate": 0.25, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 1, "activation": "linear", "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}