{"backend": "tensorflow", "config": [{"config": {"dropout": 0.0, "trainable": true, "bias_constraint": null, "recurrent_regularizer": null, "return_sequences": false, "activity_regularizer": null, "units": 200, "kernel_constraint": null, "recurrent_dropout": 0.0, "unroll": false, "unit_forget_bias": true, "return_state": false, "dtype": "float32", "implementation": 1, "bias_regularizer": null, "use_bias": true, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "activation": "tanh", "go_backwards": false, "kernel_regularizer": null, "batch_input_shape": [null, 10, 3], "stateful": false}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "name": "dropout_1", "rate": 0.25, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "units": 1, "kernel_constraint": null, "trainable": true, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.2"}