{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "use_bias": true, "unroll": false, "implementation": 1, "return_state": false, "dtype": "float32", "name": "lstm_1", "bias_regularizer": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "unit_forget_bias": true, "return_sequences": false, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 10, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "tanh", "recurrent_dropout": 0.0, "units": 200, "bias_constraint": null, "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "units": 1, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}], "keras_version": "2.2.2"}