{"keras_version": "2.2.2", "config": [{"config": {"unit_forget_bias": true, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "unroll": false, "bias_constraint": null, "recurrent_dropout": 0.0, "implementation": 1, "recurrent_regularizer": null, "batch_input_shape": [null, 10, 3], "return_sequences": false, "dtype": "float32", "dropout": 0.0, "go_backwards": false, "stateful": false, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_1", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 200, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}