{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"activation": "tanh", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "recurrent_constraint": null, "batch_input_shape": [null, 10, 3], "use_bias": true, "unroll": false, "return_sequences": false, "dtype": "float32", "unit_forget_bias": true, "kernel_regularizer": null, "stateful": false, "units": 200, "recurrent_regularizer": null, "activity_regularizer": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "bias_constraint": null, "trainable": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "name": "lstm_1"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Dense", "config": {"activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "units": 1, "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}], "keras_version": "2.2.2"}