{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "stateful": false, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 10, 3], "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "unit_forget_bias": true, "recurrent_dropout": 0.0, "kernel_constraint": null, "unroll": false, "dtype": "float32", "dropout": 0.0, "name": "lstm_1", "return_state": false, "units": 200, "bias_constraint": null, "trainable": true, "use_bias": true, "go_backwards": false, "activation": "tanh", "activity_regularizer": null, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "trainable": true, "rate": 0.25, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "use_bias": true, "units": 1, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}]}