{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "name": "lstm_1", "activity_regularizer": null, "unroll": false, "activation": "tanh", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "batch_input_shape": [null, 10, 3], "return_state": false, "return_sequences": false, "use_bias": true, "dropout": 0.0, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 200, "dtype": "float32", "implementation": 1, "recurrent_regularizer": null, "go_backwards": false, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "stateful": false, "recurrent_dropout": 0.0}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 1, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}]}