{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "return_sequences": false, "dropout": 0.0, "dtype": "float32", "recurrent_regularizer": null, "implementation": 1, "bias_regularizer": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "unit_forget_bias": true, "bias_constraint": null, "kernel_regularizer": null, "go_backwards": false, "units": 200, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "return_state": false, "use_bias": true, "trainable": true, "recurrent_constraint": null, "activation": "tanh", "activity_regularizer": null, "batch_input_shape": [null, 10, 3], "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.25, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_constraint": null, "units": 1, "bias_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "activation": "linear", "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}]}