{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"trainable": true, "return_sequences": false, "recurrent_regularizer": null, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "batch_input_shape": [null, 10, 3], "dtype": "float32", "unroll": false, "return_state": false, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "unit_forget_bias": true, "implementation": 1, "bias_regularizer": null, "kernel_constraint": null, "go_backwards": false, "units": 200, "dropout": 0.0, "activation": "tanh", "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.25, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}]}