{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_constraint": null, "dtype": "float32", "bias_constraint": null, "implementation": 1, "recurrent_dropout": 0.0, "stateful": false, "activation": "tanh", "recurrent_regularizer": null, "name": "lstm_1", "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "batch_input_shape": [null, 10, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "unroll": false, "return_sequences": false, "recurrent_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 200, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_regularizer": null, "dropout": 0.0, "return_state": false, "go_backwards": false}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 1, "name": "dense_1", "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}], "backend": "tensorflow", "keras_version": "2.2.2"}