{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"units": 200, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dtype": "float32", "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "go_backwards": false, "trainable": true, "bias_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "bias_constraint": null, "return_state": false, "use_bias": true, "recurrent_dropout": 0.0, "batch_input_shape": [null, 10, 3], "activity_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "name": "lstm_1", "unit_forget_bias": true, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "stateful": false}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"units": 1, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}]}