{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_1", "recurrent_constraint": null, "unroll": false, "unit_forget_bias": true, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "tanh", "stateful": false, "bias_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 10, 5], "implementation": 1, "use_bias": true, "return_state": false, "kernel_regularizer": null, "go_backwards": false, "units": 200, "recurrent_regularizer": null, "trainable": true, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "dropout": 0.0, "dtype": "float32", "bias_constraint": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 1, "activity_regularizer": null, "activation": "linear", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}]}