{"config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "dtype": "float32", "return_state": false, "unit_forget_bias": true, "name": "lstm_1", "implementation": 1, "bias_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_constraint": null, "activation": "tanh", "activity_regularizer": null, "batch_input_shape": [null, 24, 3], "kernel_regularizer": null, "return_sequences": false, "use_bias": true, "stateful": false, "bias_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "units": 200}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "units": 1, "bias_regularizer": null, "name": "dense_1", "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2"}