{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "dtype": "float32", "implementation": 1, "trainable": true, "recurrent_regularizer": null, "dropout": 0.0, "unroll": false, "units": 200, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "lstm_1", "batch_input_shape": [null, 24, 3], "return_sequences": false, "go_backwards": false, "return_state": false, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "stateful": false, "unit_forget_bias": true, "activation": "tanh", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "units": 1, "activation": "linear", "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}]}