{"config": [{"config": {"recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_constraint": null, "return_state": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "return_sequences": false, "activation": "tanh", "name": "lstm_1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "units": 200, "trainable": true, "go_backwards": false, "batch_input_shape": [null, 10, 3], "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "implementation": 1, "dropout": 0.0, "unroll": false, "stateful": false, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 1, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow"}