{"config": [{"config": {"stateful": false, "activation": "tanh", "kernel_constraint": null, "trainable": true, "bias_constraint": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "unroll": false, "implementation": 1, "use_bias": true, "units": 200, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 10, 3], "return_sequences": false, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "name": "lstm_1", "unit_forget_bias": true, "bias_regularizer": null, "dtype": "float32"}, "class_name": "LSTM"}, {"config": {"rate": 0.25, "name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "use_bias": true, "units": 1, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}