{"config": [{"config": {"bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 200, "recurrent_dropout": 0.0, "return_sequences": false, "use_bias": true, "name": "lstm_1", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "implementation": 1, "stateful": false, "dtype": "float32", "unit_forget_bias": true, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "activation": "tanh", "batch_input_shape": [null, 10, 3], "kernel_constraint": null, "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "noise_shape": null, "rate": 0.25, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}