{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "unit_forget_bias": true, "trainable": true, "kernel_regularizer": null, "stateful": false, "bias_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "return_state": false, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "activation": "tanh", "implementation": 1, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "lstm_1", "use_bias": true, "unroll": false, "batch_input_shape": [null, 10, 3], "units": 200}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "rate": 0.25, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "units": 1}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}], "backend": "tensorflow", "keras_version": "2.2.2"}