{"config": [{"config": {"trainable": true, "name": "lstm_1", "implementation": 1, "batch_input_shape": [null, 10, 3], "activity_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "go_backwards": false, "unit_forget_bias": true, "recurrent_constraint": null, "return_state": false, "dtype": "float32", "activation": "tanh", "bias_constraint": null, "return_sequences": false, "bias_regularizer": null, "units": 200, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "recurrent_dropout": 0.0, "use_bias": true, "kernel_regularizer": null, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_regularizer": null, "units": 1, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow"}