{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "name": "lstm_1", "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "recurrent_constraint": null, "trainable": true, "unroll": false, "implementation": 1, "return_state": false, "units": 200, "dtype": "float32", "unit_forget_bias": true, "go_backwards": false, "activation": "tanh", "bias_constraint": null, "batch_input_shape": [null, 10, 3], "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "stateful": false}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 1, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}], "backend": "tensorflow"}