{"keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "stateful": false, "unroll": false, "dropout": 0.0, "return_sequences": false, "batch_input_shape": [null, 10, 8], "activity_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "recurrent_dropout": 0.0, "dtype": "float32", "bias_regularizer": null, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "name": "lstm_1", "units": 500, "implementation": 1, "return_state": false, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}}], "backend": "tensorflow", "class_name": "Sequential"}