{"keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"dropout": 0.0, "return_sequences": false, "batch_input_shape": [null, 10, 8], "name": "lstm_1", "bias_constraint": null, "stateful": false, "kernel_regularizer": null, "recurrent_regularizer": null, "activity_regularizer": null, "go_backwards": false, "units": 500, "recurrent_dropout": 0.0, "trainable": true, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "recurrent_constraint": null, "use_bias": true, "return_state": false, "implementation": 1, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "unroll": false, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}]}