{"config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "lstm_1", "stateful": false, "units": 500, "return_state": false, "kernel_regularizer": null, "use_bias": true, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "activation": "tanh", "implementation": 1, "batch_input_shape": [null, 10, 8], "bias_constraint": null, "bias_regularizer": null, "recurrent_constraint": null, "dtype": "float32", "unroll": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "dense_1", "bias_regularizer": null, "units": 1, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}