{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"unroll": false, "return_sequences": false, "activity_regularizer": null, "batch_input_shape": [null, 10, 8], "trainable": true, "kernel_constraint": null, "units": 500, "unit_forget_bias": true, "bias_constraint": null, "return_state": false, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "activation": "tanh", "recurrent_regularizer": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "use_bias": true, "dtype": "float32", "dropout": 0.0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "go_backwards": false, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "units": 1, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}}], "keras_version": "2.2.2"}