{"class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "activation": "tanh", "recurrent_dropout": 0.0, "unroll": false, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "recurrent_constraint": null, "bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "batch_input_shape": [null, 10, 8], "return_sequences": false, "return_state": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "recurrent_regularizer": null, "use_bias": true, "stateful": false, "name": "lstm_1", "kernel_constraint": null, "dropout": 0.0, "units": 500, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "linear", "trainable": true, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_1", "trainable": true}}]}