{"class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"units": 500, "implementation": 1, "bias_constraint": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "bias_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "activity_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 10, 8], "activation": "tanh", "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "lstm_1", "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "unit_forget_bias": true, "use_bias": true, "recurrent_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 1, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}]}