{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"unit_forget_bias": true, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "return_sequences": false, "bias_constraint": null, "units": 200, "unroll": false, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32", "bias_regularizer": null, "recurrent_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "recurrent_constraint": null, "return_state": false, "batch_input_shape": [null, 30, 8], "activity_regularizer": null, "implementation": 1, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "dropout": 0.0}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "linear", "name": "dense_1", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "units": 1, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}], "keras_version": "2.2.2", "backend": "tensorflow"}