{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "recurrent_constraint": null, "return_sequences": false, "bias_constraint": null, "implementation": 1, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "dropout": 0.0, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 30, 8], "unroll": false, "trainable": true, "activity_regularizer": null, "stateful": false, "use_bias": true, "go_backwards": false, "unit_forget_bias": true, "name": "lstm_1", "return_state": false, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "units": 500}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "linear", "kernel_regularizer": null, "units": 1, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_1", "trainable": true}}], "backend": "tensorflow"}