{"config": [{"config": {"kernel_regularizer": null, "bias_regularizer": null, "implementation": 1, "unit_forget_bias": true, "dropout": 0.0, "trainable": true, "units": 200, "name": "lstm_1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unroll": false, "activity_regularizer": null, "kernel_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 30, 5], "use_bias": true, "return_sequences": false, "activation": "tanh", "recurrent_constraint": null, "return_state": false, "stateful": false, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "trainable": true, "rate": 0.25, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "linear", "units": 1, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow"}