{"config": [{"config": {"name": "lstm_2", "return_state": false, "batch_input_shape": [null, 24, 9], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "tanh", "use_bias": true, "recurrent_constraint": null, "implementation": 1, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 20, "dropout": 0.0, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "bias_constraint": null, "trainable": true, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "seed": null, "rate": 0.25, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "units": 1, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}