{"keras_version": "2.2.2", "config": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "dtype": "float32", "stateful": false, "bias_constraint": null, "recurrent_regularizer": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "use_bias": true, "unit_forget_bias": true, "recurrent_dropout": 0.0, "trainable": true, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_1", "implementation": 1, "go_backwards": false, "activity_regularizer": null, "return_state": false, "batch_input_shape": [null, 10, 11], "units": 50, "kernel_constraint": null, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "units": 1, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}