{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_1", "kernel_constraint": null, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "recurrent_regularizer": null, "return_sequences": false, "recurrent_constraint": null, "unroll": false, "go_backwards": false, "unit_forget_bias": true, "use_bias": true, "dtype": "float32", "activation": "tanh", "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "return_state": false, "trainable": true, "implementation": 1, "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "recurrent_dropout": 0.0, "batch_input_shape": [null, 24, 11], "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "dense_1", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "trainable": true, "units": 1, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}]}