{"config": [{"config": {"bias_regularizer": null, "return_sequences": false, "dtype": "float32", "use_bias": true, "recurrent_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 10, 3], "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "go_backwards": false, "name": "lstm_1", "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "units": 200, "unroll": false, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "trainable": true, "implementation": 1}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "units": 1, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}