{"config": [{"config": {"go_backwards": false, "bias_regularizer": null, "dtype": "float32", "unit_forget_bias": true, "activation": "tanh", "unroll": false, "return_state": false, "bias_constraint": null, "units": 200, "implementation": 1, "use_bias": true, "stateful": false, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dropout": 0.0, "batch_input_shape": [null, 12, 3], "name": "lstm_1", "recurrent_dropout": 0.0, "recurrent_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": false, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "seed": null, "rate": 0.25, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "activation": "linear", "units": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2"}