{"keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"unit_forget_bias": true, "recurrent_constraint": null, "bias_regularizer": null, "unroll": false, "trainable": true, "batch_input_shape": [null, 10, 3], "kernel_constraint": null, "implementation": 1, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "go_backwards": false, "return_sequences": false, "return_state": false, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "stateful": false, "activity_regularizer": null, "bias_constraint": null, "recurrent_regularizer": null, "dropout": 0.0, "kernel_regularizer": null, "dtype": "float32", "activation": "tanh", "units": 200}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "rate": 0.25, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "units": 1, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}], "backend": "tensorflow"}