{"config": [{"config": {"dropout": 0.0, "implementation": 1, "bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "batch_input_shape": [null, 12, 3], "kernel_constraint": null, "use_bias": true, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true, "unroll": false, "return_sequences": false, "kernel_regularizer": null, "units": 200, "activity_regularizer": null, "activation": "tanh", "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "name": "lstm_1", "trainable": true, "return_state": false, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}