{"keras_version": "2.2.2", "backend": "tensorflow", "config": [{"config": {"recurrent_constraint": null, "unit_forget_bias": true, "go_backwards": false, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_constraint": null, "batch_input_shape": [null, 60, 3], "recurrent_regularizer": null, "recurrent_dropout": 0.0, "return_state": false, "return_sequences": false, "activation": "tanh", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unroll": false, "name": "lstm_1", "implementation": 1, "stateful": false, "recurrent_activation": "hard_sigmoid", "use_bias": true, "activity_regularizer": null, "dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 200, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"rate": 0.25, "trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 1, "bias_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential"}