{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "return_state": false, "units": 200, "recurrent_regularizer": null, "go_backwards": false, "unroll": false, "stateful": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32", "return_sequences": false, "kernel_regularizer": null, "name": "lstm_1", "dropout": 0.0, "activation": "tanh", "batch_input_shape": [null, 12, 3], "implementation": 1, "activity_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "noise_shape": null, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 1}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}], "backend": "tensorflow"}