{"config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 12, 3], "dtype": "float32", "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "units": 200, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dropout": 0.0, "recurrent_constraint": null, "activation": "tanh", "bias_constraint": null, "implementation": 1, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "stateful": false, "recurrent_regularizer": null, "bias_regularizer": null, "return_state": false, "kernel_regularizer": null, "recurrent_dropout": 0.0, "name": "lstm_1", "return_sequences": false, "unroll": false, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 1, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}