{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 200, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "recurrent_regularizer": null, "dtype": "float32", "implementation": 1, "recurrent_constraint": null, "return_sequences": false, "unroll": false, "return_state": false, "activation": "tanh", "kernel_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "trainable": true, "dropout": 0.0, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 12, 3], "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "name": "lstm_1", "stateful": false}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "kernel_constraint": null, "units": 1, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}]}