{"keras_version": "2.2.2", "config": [{"config": {"use_bias": true, "recurrent_dropout": 0.0, "batch_input_shape": [null, 60, 3], "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 200, "activation": "tanh", "recurrent_regularizer": null, "dropout": 0.0, "implementation": 1, "kernel_constraint": null, "return_state": false, "return_sequences": false, "name": "lstm_1", "recurrent_constraint": null, "stateful": false, "trainable": true, "unit_forget_bias": true, "kernel_regularizer": null, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "name": "dense_1", "kernel_constraint": null, "units": 1, "activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}