{"keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"bias_constraint": null, "go_backwards": false, "kernel_constraint": null, "trainable": true, "return_state": false, "stateful": false, "recurrent_constraint": null, "activation": "tanh", "implementation": 1, "recurrent_regularizer": null, "name": "lstm_1", "unit_forget_bias": true, "use_bias": true, "batch_input_shape": [null, 60, 3], "units": 200, "dtype": "float32", "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "unroll": false}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "trainable": true, "rate": 0.25, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "name": "dense_1", "use_bias": true, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}], "backend": "tensorflow", "class_name": "Sequential"}