{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "name": "lstm_1", "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "stateful": false, "bias_regularizer": null, "activation": "tanh", "go_backwards": false, "use_bias": true, "return_sequences": false, "implementation": 1, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 200, "unit_forget_bias": true, "batch_input_shape": [null, 10, 3], "trainable": true, "return_state": false, "recurrent_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "recurrent_constraint": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 1, "bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}], "backend": "tensorflow", "keras_version": "2.2.2"}