{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"return_sequences": false, "recurrent_regularizer": null, "trainable": true, "use_bias": true, "return_state": false, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "go_backwards": false, "kernel_regularizer": null, "name": "lstm_1", "activity_regularizer": null, "units": 200, "dropout": 0.0, "unroll": false, "recurrent_constraint": null, "dtype": "float32", "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "stateful": false, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "batch_input_shape": [null, 60, 3], "activation": "tanh", "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.25, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "units": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}], "backend": "tensorflow"}