{"config": [{"config": {"return_sequences": false, "return_state": false, "stateful": false, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "dropout": 0.0, "use_bias": true, "recurrent_constraint": null, "implementation": 1, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "activity_regularizer": null, "go_backwards": false, "unroll": false, "kernel_regularizer": null, "batch_input_shape": [null, 60, 3], "bias_constraint": null, "units": 200, "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.25, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null, "units": 1, "trainable": true, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow"}