{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "name": "lstm_1", "kernel_constraint": null, "go_backwards": false, "stateful": false, "unit_forget_bias": true, "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "implementation": 1, "dropout": 0.0, "trainable": true, "bias_constraint": null, "recurrent_constraint": null, "batch_input_shape": [null, 10, 3], "unroll": false, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 200, "kernel_regularizer": null, "use_bias": true, "recurrent_dropout": 0.0, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "units": 1, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}], "keras_version": "2.2.2"}