{"keras_version": "2.2.2", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "unit_forget_bias": true, "activation": "tanh", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "return_state": false, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "name": "lstm_1", "bias_constraint": null, "units": 200, "bias_regularizer": null, "batch_input_shape": [null, 10, 3], "use_bias": true, "stateful": false, "unroll": false, "recurrent_constraint": null, "return_sequences": false, "recurrent_regularizer": null, "implementation": 1}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "seed": null, "name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "units": 1, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}