{"backend": "tensorflow", "keras_version": "2.2.2", "config": [{"config": {"trainable": true, "bias_regularizer": null, "return_state": false, "return_sequences": false, "kernel_regularizer": null, "units": 200, "batch_input_shape": [null, 10, 3], "name": "lstm_1", "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "implementation": 1, "recurrent_regularizer": null, "dropout": 0.0, "unit_forget_bias": true, "use_bias": true, "recurrent_dropout": 0.0, "go_backwards": false, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "stateful": false, "dtype": "float32", "activity_regularizer": null, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "use_bias": true, "trainable": true, "kernel_regularizer": null, "units": 1, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}