{"keras_version": "2.2.2", "backend": "tensorflow", "config": [{"config": {"dtype": "float32", "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 200, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "unroll": false, "return_state": false, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": false, "recurrent_regularizer": null, "batch_input_shape": [null, 10, 3], "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "implementation": 1, "stateful": false, "recurrent_constraint": null, "name": "lstm_1", "use_bias": true, "dropout": 0.0, "trainable": true}, "class_name": "LSTM"}, {"config": {"seed": null, "name": "dropout_1", "rate": 0.25, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}