{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"return_sequences": false, "unroll": false, "dropout": 0.0, "activation": "tanh", "batch_input_shape": [null, 10, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "implementation": 1, "stateful": false, "bias_constraint": null, "units": 200, "return_state": false, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "unit_forget_bias": true, "trainable": true, "use_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_constraint": null, "dtype": "float32", "name": "lstm_1", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.25, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "units": 1, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}], "backend": "tensorflow", "keras_version": "2.2.2"}