{"keras_version": "2.2.2", "config": [{"config": {"unit_forget_bias": true, "name": "lstm_1", "batch_input_shape": [null, 10, 3], "implementation": 1, "recurrent_dropout": 0.0, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 200, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "stateful": false, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "unroll": false, "go_backwards": false, "recurrent_constraint": null, "kernel_regularizer": null, "use_bias": true, "return_sequences": false, "dtype": "float32", "dropout": 0.0, "return_state": false, "activity_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "trainable": true}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 1, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}