{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "trainable": true, "kernel_constraint": null, "batch_input_shape": [null, 10, 3], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false, "unroll": false, "go_backwards": false, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "implementation": 1, "dropout": 0.0, "units": 200, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "unit_forget_bias": true, "recurrent_dropout": 0.0, "use_bias": true, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "return_state": false}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.25, "noise_shape": null}}, {"class_name": "Dense", "config": {"activation": "linear", "units": 1, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}]}