{"backend": "tensorflow", "config": [{"config": {"recurrent_regularizer": null, "return_sequences": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unroll": false, "dropout": 0.0, "dtype": "float32", "activation": "tanh", "bias_constraint": null, "return_state": false, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 10, 3], "activity_regularizer": null, "recurrent_constraint": null, "use_bias": true, "stateful": false, "unit_forget_bias": true, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 1, "recurrent_dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "trainable": true, "bias_regularizer": null, "units": 200}, "class_name": "LSTM"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "bias_regularizer": null, "units": 1}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "keras_version": "2.2.2", "class_name": "Sequential"}