{"config": [{"config": {"kernel_regularizer": null, "use_bias": true, "stateful": false, "bias_constraint": null, "kernel_constraint": null, "units": 200, "trainable": true, "recurrent_constraint": null, "dtype": "float32", "activity_regularizer": null, "return_state": false, "go_backwards": false, "dropout": 0.0, "batch_input_shape": [null, 10, 3], "name": "lstm_1", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "unroll": false, "return_sequences": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "rate": 0.25, "trainable": true, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "trainable": true, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2"}