{"keras_version": "2.2.2", "backend": "tensorflow", "config": [{"config": {"recurrent_regularizer": null, "activity_regularizer": null, "unroll": false, "units": 200, "implementation": 1, "recurrent_dropout": 0.0, "return_sequences": false, "unit_forget_bias": true, "trainable": true, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "stateful": false, "go_backwards": false, "activation": "tanh", "batch_input_shape": [null, 10, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "recurrent_constraint": null, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "seed": null, "rate": 0.25, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "units": 1, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential"}