{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"unit_forget_bias": true, "trainable": true, "return_sequences": false, "recurrent_regularizer": null, "bias_constraint": null, "return_state": false, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "units": 200, "dtype": "float32", "recurrent_dropout": 0.0, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "dropout": 0.0, "implementation": 1, "stateful": false, "batch_input_shape": [null, 10, 3], "kernel_constraint": null, "recurrent_constraint": null, "unroll": false, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 1, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}]}