{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"units": 200, "stateful": false, "recurrent_dropout": 0.0, "batch_input_shape": [null, 10, 3], "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "return_sequences": false, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "implementation": 1, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "bias_regularizer": null, "trainable": true, "recurrent_regularizer": null, "activation": "tanh", "dropout": 0.0, "kernel_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 1, "name": "dense_1", "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}], "keras_version": "2.2.2"}