{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "trainable": true, "name": "lstm_1", "bias_constraint": null, "return_sequences": false, "implementation": 1, "units": 500, "activation": "tanh", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "batch_input_shape": [null, 10, 11], "stateful": false, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "unit_forget_bias": true, "recurrent_regularizer": null, "activity_regularizer": null, "unroll": false}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_1", "use_bias": true, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}]}