{"backend": "tensorflow", "config": [{"config": {"recurrent_constraint": null, "unit_forget_bias": true, "activation": "tanh", "dropout": 0.0, "return_sequences": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 24, 11], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "implementation": 1, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activity_regularizer": null, "unroll": false, "units": 500, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "trainable": true, "return_state": false, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"seed": null, "rate": 0.25, "name": "dropout_1", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "units": 1, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.2"}