{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "dropout": 0.0, "return_state": false, "batch_input_shape": [null, 24, 3], "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "unit_forget_bias": true, "bias_constraint": null, "units": 200, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "stateful": false, "go_backwards": false, "return_sequences": false, "name": "lstm_1", "trainable": true, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dtype": "float32", "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_1", "rate": 0.25, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "units": 1, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}]}