{"backend": "tensorflow", "config": [{"config": {"unit_forget_bias": true, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "name": "lstm_1", "batch_input_shape": [null, 24, 3], "recurrent_activation": "hard_sigmoid", "activation": "tanh", "activity_regularizer": null, "bias_constraint": null, "unroll": false, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "return_sequences": false, "units": 200, "dropout": 0.0, "return_state": false, "recurrent_dropout": 0.0, "stateful": false, "use_bias": true, "implementation": 1, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "rate": 0.25, "trainable": true, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 1, "trainable": true, "name": "dense_1", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "linear", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.2"}