{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"units": 200, "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32", "return_sequences": false, "recurrent_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "batch_input_shape": [null, 24, 3], "dropout": 0.0, "bias_regularizer": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "unroll": false, "kernel_constraint": null, "bias_constraint": null, "unit_forget_bias": true, "go_backwards": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "return_state": false, "kernel_regularizer": null, "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.25, "trainable": true, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"units": 1, "kernel_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}], "keras_version": "2.2.2"}