{"backend": "tensorflow", "config": [{"config": {"bias_constraint": null, "recurrent_constraint": null, "kernel_constraint": null, "dtype": "float32", "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "tanh", "dropout": 0.0, "stateful": false, "return_sequences": false, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 10, 3], "trainable": true, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 200, "activity_regularizer": null, "use_bias": true, "unit_forget_bias": true, "unroll": false, "go_backwards": false, "implementation": 1}, "class_name": "LSTM"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "activity_regularizer": null, "activation": "linear", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.2"}