{"config": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "unit_forget_bias": true, "stateful": false, "go_backwards": false, "batch_input_shape": [null, 10, 3], "return_state": false, "dropout": 0.0, "implementation": 1, "name": "lstm_1", "recurrent_dropout": 0.0, "unroll": false, "return_sequences": false, "recurrent_constraint": null, "units": 200, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "activation": "tanh", "use_bias": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "trainable": true, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}