{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"unroll": false, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_constraint": null, "trainable": true, "kernel_constraint": null, "units": 200, "unit_forget_bias": true, "return_state": false, "dropout": 0.0, "return_sequences": false, "activity_regularizer": null, "go_backwards": false, "stateful": false, "name": "lstm_1", "batch_input_shape": [null, 10, 3], "dtype": "float32", "bias_constraint": null, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 1}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}]}