{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "return_state": false, "use_bias": true, "batch_input_shape": [null, 10, 3], "name": "lstm_1", "units": 200, "recurrent_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "stateful": false, "implementation": 1, "go_backwards": false, "return_sequences": false, "unit_forget_bias": true, "activation": "tanh", "trainable": true, "recurrent_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "unroll": false}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "units": 1, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}], "keras_version": "2.2.2"}