{"config": [{"config": {"dtype": "float32", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_1", "use_bias": true, "return_state": false, "go_backwards": false, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": false, "implementation": 1, "bias_constraint": null, "unit_forget_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "unroll": false, "kernel_constraint": null, "stateful": false, "batch_input_shape": [null, 10, 3], "units": 200, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.25, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "linear", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}