{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "trainable": true, "kernel_constraint": null, "units": 200, "implementation": 1, "dropout": 0.0, "unroll": false, "batch_input_shape": [null, 10, 3], "stateful": false, "activity_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "go_backwards": false, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "return_state": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "rate": 0.25, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}], "keras_version": "2.2.2"}