{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"dtype": "float32", "stateful": false, "go_backwards": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 10, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "return_sequences": false, "kernel_regularizer": null, "name": "lstm_1", "unit_forget_bias": true, "use_bias": true, "recurrent_constraint": null, "activation": "tanh", "units": 200, "kernel_constraint": null, "activity_regularizer": null, "unroll": false, "implementation": 1, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.25, "trainable": true, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"units": 1, "activation": "linear", "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}]}