{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 10, 3], "trainable": true, "dropout": 0.0, "bias_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false, "dtype": "float32", "go_backwards": false, "recurrent_regularizer": null, "stateful": false, "unroll": false, "units": 200, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "return_state": false, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "kernel_regularizer": null, "implementation": 1, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activation": "tanh", "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "rate": 0.25, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "units": 1, "activation": "linear", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}]}