{"keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"return_state": false, "unit_forget_bias": true, "use_bias": true, "units": 200, "dtype": "float32", "return_sequences": false, "bias_regularizer": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "batch_input_shape": [null, 10, 3], "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "stateful": false, "activation": "tanh", "recurrent_regularizer": null, "implementation": 1, "recurrent_dropout": 0.0, "kernel_regularizer": null, "unroll": false, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}], "backend": "tensorflow", "class_name": "Sequential"}