{"config": [{"config": {"unit_forget_bias": true, "return_sequences": false, "return_state": false, "bias_regularizer": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "kernel_regularizer": null, "trainable": true, "use_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "unroll": false, "implementation": 1, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 200, "activation": "tanh", "go_backwards": false, "recurrent_constraint": null, "kernel_constraint": null, "bias_constraint": null, "recurrent_regularizer": null, "name": "lstm_1", "dtype": "float32", "batch_input_shape": [null, 10, 3]}, "class_name": "LSTM"}, {"config": {"seed": null, "rate": 0.25, "name": "dropout_1", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow"}