{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"unit_forget_bias": true, "recurrent_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "units": 200, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "recurrent_constraint": null, "bias_constraint": null, "kernel_constraint": null, "activation": "tanh", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "dropout": 0.0, "return_state": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "stateful": false, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "batch_input_shape": [null, 20, 5], "return_sequences": false, "dtype": "float32"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "noise_shape": null, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "name": "dense_1", "use_bias": true, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}], "backend": "tensorflow"}