{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"unit_forget_bias": true, "trainable": true, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "units": 200, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "name": "lstm_1", "dropout": 0.0, "activity_regularizer": null, "return_sequences": false, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 1, "go_backwards": false, "activation": "tanh", "unroll": false, "batch_input_shape": [null, 20, 5], "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.25, "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}], "backend": "tensorflow"}