{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "recurrent_activation": "hard_sigmoid", "units": 200, "activity_regularizer": null, "recurrent_regularizer": null, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "unit_forget_bias": true, "return_state": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "dropout": 0.0, "unroll": false, "name": "lstm_1", "recurrent_dropout": 0.0, "batch_input_shape": [null, 20, 5], "kernel_constraint": null, "stateful": false, "implementation": 1, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"activation": "linear", "use_bias": true, "units": 1, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}]}