{"backend": "tensorflow", "keras_version": "2.2.2", "config": [{"config": {"use_bias": true, "bias_constraint": null, "bias_regularizer": null, "dropout": 0.0, "return_sequences": false, "recurrent_dropout": 0.0, "activation": "tanh", "unit_forget_bias": true, "return_state": false, "unroll": false, "units": 200, "batch_input_shape": [null, 20, 5], "name": "lstm_1", "recurrent_constraint": null, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "trainable": true, "go_backwards": false, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "implementation": 1, "stateful": false}, "class_name": "LSTM"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "units": 1, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"activation": "linear", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential"}