{"config": [{"config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "name": "lstm_1", "units": 200, "bias_constraint": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "recurrent_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 20, 5], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_sequences": false, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "stateful": false, "activation": "tanh", "trainable": true, "unroll": false, "recurrent_activation": "hard_sigmoid", "return_state": false, "unit_forget_bias": true, "use_bias": true}, "class_name": "LSTM"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "name": "dense_1", "units": 1, "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow"}